# Introduce into Machine Learning World
instead of program or set a rule for find what a picture of cat(it's really hard and complicated), we use math or algorithm find the data pattern to done the task.

* Supervised Learning : you have data and labels, use data to predict labels ex. classification, regrssion.
* Unsupervised Learning : have only data, use data try to find group then apply a lebels is called *clustering*.
* Transfer Learning : model B try to learn from model A and get it better or apply for a similar task.
* Reinforcement Learning : reward or punishment ex. alphago.

## PANDAS

In [1]:
import pandas as pd

In [2]:
# series = 1D
series = pd.Series(['BMW','Toyota','Honda'])
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [3]:
# dataframe = 2D
dataframe = pd.DataFrame({'Car make': series, 'Colour': ['Red','Green','Blue']})
dataframe

  Car make Colour
0      BMW    Red
1   Toyota  Green
2    Honda   Blue

In [4]:
# load data
car_data = pd.read_csv('data/car-sales.csv')
car_data.head(5)

# export data
# car_data.to_csv('filename.csv')

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

> rows, columns = axis0 , axis1

### Describe data

In [45]:
car_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [13]:
car_data.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [20]:
car_data.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [34]:
car_data['Doors'].sum() # or max mean min ...

40

### Viewing and Selecting data
* loc : location(like keys in dict)
* iloc : index location(like list index)

In [46]:
animals = pd.Series(['cat','dog','bird','panda','shark'], index=[0,3,4,5,6])
animals

0      cat
3      dog
4     bird
5    panda
6    shark
dtype: object

In [56]:
print('loc[3] :',animals.loc[3])
print('iloc[3] :',animals.iloc[3])

loc[3] : dog
iloc[3] : panda

In [62]:
car_data.loc[2] == car_data.iloc[2] # because index is run from 0 to len(data)

Make             True
Colour           True
Odometer (KM)    True
Doors            True
Price            True
Name: 2, dtype: bool

In [70]:
car_data.iloc[:3] # loc in a list index

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [72]:
car_data.loc[:3] # iloc is a keys in dict

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [73]:
car_data[car_data['Make'] == 'Toyota']

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00